// Помогите Даше решить проблему
// Юная художница Даша писала поле из молодых томатов "Черри" и напевала себе под нос:
// "В мире том, где есть дом, до родного далеко, А там и близко никакого в другом..."
// Как в какой-то момент её совсем склонило в сон. Очнувшись в подземелье у драконов, она ужаснулась происходящему вокруг неё. Рядом с ней горел костёр, в котором сжигали за неправильный ответ. Даша нервно стояла в очереди, как вдруг незнакомка позади неё тихо сказала:
// "Так беспомощно грудь холодела, Но шаги мои были легки..."
// Как бы она ни была в авангарде искусства, как бы она ни шагала навстречу судьбе, а супрематизм всё же черней...
// Старик закидывал невод в море, а драконы в костёр одного за другим. И подходила всё ближе Даша, да тепло уже ощущалось...
// Как вдруг привиделось ей небо, то самое высокое бесконечное небо... И послышался голос с неба, и сказал он Даше:
// "Сложи ты два числа, да будет жизнь тебе дарована. И увидишь вновь меня, и услышишь черри запах."
// И вот настал час роковой, поднялась Даша к палачу, встала на мостик. Задали ей вопрос: "Что решит проблему?". И не решилась Даша отказать небу, и сказала она: "Сложение двух чисел есть мой ответ."
// И вернулась Даша обратно на поле черри, и солнце вновь осветило её нежные веснушки...

// Входные данные
// В единственной строке записано два числа − -10^11≤A,B≤10^11

// Выходные данные
// В единственной строке выведите сумму чисел A+B

// Сложность - O(1)
// Память - O(1)

#include <iostream>

int main()
{
    long long a;
    long long b;
    std::cin >> a >> b;
    std::cout << a + b;
}